{"version":"preview","releaseDate":"2024-01-17T12:03:14.458Z","blips":[{"id":1,"refName":"chatgpt","title":"ChatGPT","quadrantId":"tools","ring":"trial","description":"[ChatGPT](https://openai.com/chatgpt) is a large-language model (LLM) capable\nof providing answers to complex questions posed with natural language. It is\nable to process text, images and more recently with voice.\n\nAccess to the model is provided through:\n\n- a web-based chat client.\n- an API with bindings available for many populate languages.\n","comments":"\nCurrently used mostly for ad-hoc queries during development. For this reason it\nis currently in trial.\n"},{"id":2,"refName":"continuous-delivery","title":"Continuous Delivery","quadrantId":"techniques","ring":"adopt","description":"[Continuous Delivery](https://resources.github.com/devops/fundamentals/ci-cd/deployment/)\nbuilds on continuous integration by automating deployment to a staging environment.\nThe final release to production is still controlled manually by developers\ncoordinating with customers on release schedules.\n","comments":"\nThis technique is adopted across most software teams within the division so it\nsits in adopt.\n"},{"id":3,"refName":"jenkins","title":"Jenkins","quadrantId":"tools","ring":"adopt","description":"[Jenkins](https://jenkins.io) is an automation server for running tasks.\nIts plugin system allows for extensions supporting CI/CD as well as implementing\npipelines as code and configuring Jenkins itself through configuration files.\n","comments":"\nJenkins is in widespread use across ICD for both CI/CD tasks.\n\nNew projects should seriously consider whether managed solutions such as\n[GitHub Actions](https://docs.github.com/en/actions) could support all project CI/CD\nrequirements rather than taking on the ongoing support and maintenance of\ninternal Jenkins deployments.\n\nAny new deployments should use containerisation and the\n[Configuration as Code](https://www.jenkins.io/projects/jcasc/) paradigm and not\nmanual setup through the UI.\n"},{"id":4,"refName":"ruff","title":"Ruff","quadrantId":"tools","ring":"adopt","description":"[Ruff](https://docs.astral.sh/ruff/) is an alternative Python linter aimed at\nboosting performance of Python linting over something like flake8. It is written\nin Rust and combines a myriad of traditional linters into single package.\n","comments":"\nIt is seen as stable by many projects and has been adopted by the Data Reduction\nteam.\n"},{"id":5,"refName":"documentation-testing","title":"Documentation Testing","quadrantId":"techniques","ring":"adopt","description":"Documentation testing is a general term for automatically verifying\nexample code where it appears in library documentation.\n","comments":"\nIt is particularly strongly used within the Python community where the\n[documentation tooling](https://www.sphinx-doc.org/en/master/usage/extensions/doctest.html)\nsupports executing, verifying and reporting on the status of tests.\n"},{"id":6,"refName":"argocd","title":"ArgoCD","quadrantId":"tools","ring":"trial","description":"[ArgoCD](https://argoproj.github.io/cd/) is a continuous delivery tool for\nKubernetes based on GitOps. The required state for an application\nis stored in a Git repository and ArgoCD automates the deployment to\nthe target environments. A UI is provided enabling\n\n- continuous monitoring deployments\n- visualizing differences in desired & deployed state\n","comments":"\nIt is currently on trial within the\n[Interactive Reduction](https://github.com/interactivereduction) project.\n"},{"id":7,"refName":"read-the-docs","title":"Read the Docs","quadrantId":"platforms","ring":"adopt","description":"[Read the Docs](https://docs.readthedocs.io/en/stable/) is a documentation hosting\nplatform for static web pages, based on Git repositories. A commit to a branch\nin a git repository triggers a build and publish step without the need to support\nany of the infrastructure. They provide community optsion for open-source projects\nand business options for more complex needs.\n","comments":"\nThe platform has widespread use in the Scientific Software Group.\n"},{"id":8,"refName":"kubernetes","title":"Kubernetes","quadrantId":"platforms","ring":"adopt","description":"[Kubernetes](https://kubernetes.io/), also known as K8s, is an open-source system\nfor automating deployment, scaling, and management of containerized applications.\n","comments":"\nKubernetes is cloud-agnostic and can run in any of the public clouds but also\nwithin the STFC cloud.\nKubernetes has been adopted by many teams who all use it to deploy their\ncontainerized applications through the STFC cloud.\n"},{"id":9,"refName":"markdown","title":"Markdown","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[Markdown](https://www.markdownguide.org/) is a lightweight markup language to\nadd formatting elements to text-based documents that is easy to version control.\nMany flavours are markdown exist such as [CommonMark](http://commonmark.org/) and\n[GitHub Flavoured Markdown](https://developer.github.com/v3/markdown/)\nso care must be taken in understanding the engine that will process any\nmarkdown that is written.\n","comments":"\nA widely used technology that has been adopted by all software teams.\n"},{"id":10,"refName":"domain-driven-design","title":"Domain Driven Design","quadrantId":"techniques","ring":"adopt","description":"[Domain Driven Design](https://en.wikipedia.org/wiki/Domain-driven_design)(DDD) is\nthe practice of designing and architecting software that breaks down the system\naccording to aspects of the problem domain rather than grouping elements by\ntheir technical association.\n","comments":"\nDDD couples very well with a microservices architecture where each subdomain\nis isolated as separate service that then communicate as whole. It is widely\nadopted by industry and across the division so sits in adopt.\n"},{"id":11,"refName":"oracle-db","title":"Oracle Database","quadrantId":"platforms","ring":"hold","description":"[Oracle Database](https://www.oracle.com/database/) is a proprietary multi-model\ndatabase management system developed by Oracle including support for on-premise\ndeployment as well as with Oracle Cloud.\n","comments":"\nWe opt to prefer cross-platform, open-source solutions for new projects as they\navoid licensing issues.\n"},{"id":12,"refName":"jira","title":"Jira","quadrantId":"tools","ring":"trial","description":"[Jira](https://www.atlassian.com/software/jira) is an advanced work-management\ntool to plan, track, release and report on project progress. Jira also includes\nsupport for advanced automation. It contains first-class support for Agile\nways of working such as Kanban and Scrum.\n","comments":"\nIt is currently under trial by the Scientific Software Group.\n"},{"id":13,"refName":"bun","title":"Bun","quadrantId":"platforms","ring":"assess","description":"[Bun](https://bun.sh) is a new Javascript toolkit including a:\n\n- JavaScript runtime\n- transpiler: run TypeScript files directly\n- bundler\n- test runner\n- Node.js-compatible package manager.\n\nIt provides and all-in-one solution to replace many common JavaScript-based project\ntools with the added benefit of much improved performance.\n","comments":"\nIt is yet to be trialed anywhere but looks interesting enough that it should be\ntrialed and therefore resides in assess.\n"},{"id":14,"refName":"nagios-xi","title":"Nagios XI","quadrantId":"tools","ring":"trial","description":"[Nagios XI](https://www.nagios.com/products/nagios-xi/) is an enterprise-grade\nnetwork and system monitoring tool for automated, customizable monitoring of\ncritical infrastructure.\n","comments":"\nIt is being trialied by the Infrastructure team.\n"},{"id":15,"refName":"network-access-control","title":"Network Access Control","quadrantId":"techniques","ring":"assess","description":"[Network Access Control](https://en.wikipedia.org/wiki/Network_Access_Control)\naims to control access to a network with policies, including pre-admission endpoint\nsecurity policy checks and post-admission controls over where users and devices\ncan go on a network and what they can do.\n","comments":"\nAn emerging security category that is worth keeping up to date with developments\nand assessing suitability for ISIS.\n"},{"id":16,"refName":"python","title":"Python","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[Python](https://www.python.org) is a general-purpose interpreted programming\nlanguage. It has an emphasis on readability and is considered an easier language\nto learning programming concepts as the code can be executed directly without\na compilation step. It regularly features in the top 5 programming languages\nused by developers around the world.\n","comments":"\nIt is ubiquitous within the scientific computing arena where performance is also\na critical factor. Many libraries have been written in system languages wrapped\nwith a Python API to strike a balance between usability and performance.\n\nThe latest Python 3.x version should be chosen depending on the available\nsupport of third-party libraries. In the case of writing a library for others\nto consume consider what is the latest version users are able to use along\nwith the availability of package managers such as\n[Pip](https://pip.pypa.io/en/stable/installation/) &\n[Conda](https://docs.conda.io/projects/conda/en/latest/user-guide/tasks/manage-python.html).\n\n**Python 2.x** should not be used. Any code running in this version should\nconsidered a security risk and a migration plan for this code should be created.\n"},{"id":17,"refName":"java-spring","title":"Java Spring","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[Java Spring](https://spring.io/projects/spring-framework)\nis an application and inversion-of-control framework for Java. Extensions are\navailable for writing web applications along with\n[Sprint Boot](https://spring.io/projects/spring-boot) for an opinionated view\nof how applications should be configured.\n","comments":"\nFavoured over Jakarta EE as it is considered simpler to use so we have\nplaced it in adopt.\n"},{"id":18,"refName":"jakarta-ee","title":"Jakarta EE","quadrantId":"languages-and-frameworks","ring":"hold","description":"[Jakarta EE](https://jakarta.ee/), formerly Java EE, specifies a set of features\nextending the standard Java specification with additional features for enterprise\nrequirements such as distributed computing and web services.\n","comments":"\nWhile EE is a complete specification the consensus has been that Java Spring\nprovides an easier to use framework, especially when coupled with Spring Boot.\nWe therefore place this in hold.\n"},{"id":19,"refName":"polars","title":"Polars","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[Polars](https://pola-rs.github.io/polars-book/) is a library providing a\nDataFrame structure and operations much like Pandas. It is written as a\nRust crate and also proviedes a Python API on top.\n","comments":"\nA robust tool, including support for a variety of different file formats\nthat is useful for any ad-hoc analysis so it is in adopt.\nIf performance is key consider trying Polars and falling back to Pandas\nif Polars lacks support for the use case.\n"},{"id":20,"refName":"teamcity","title":"TeamCity","quadrantId":"tools","ring":"assess","description":"[TeamCity](https://www.jetbrains.com/teamcity/) is a continuous-integration\nsolution offered by JetBrains available as an on-premise solution or as a cloud\nservice.\n","comments":"\nMany teams are quite bedded in with their CI solutions of either Jenkins or\nGitHub actions or a combination of both. TeamCity is left as something to be\naware of but not actively pursue at this time.\n"},{"id":21,"refName":"logstash","title":"Logstash","quadrantId":"platforms","ring":"adopt","description":"[Logstash](https://www.elastic.co/logstash/) is a free and open server-side data\nprocessing pipeline that ingests data from multiple sources,\noptionally transforming it, and then sending it to a \"stash\".\n","comments":"\nDespite recent licensing changes around Elasticsearch, Logstash remains free and widely\nused for collection of log data. It also fits with OpenSearch and those currently\nusing Elasticsearch are likely to migrate to OpenSearch.\n"},{"id":22,"refName":"linkerd","title":"Linkerd","quadrantId":"languages-and-frameworks","ring":"assess","description":"[Linkerd](https://linkerd.io) is a service mesh for Kubernetes. It allows for\nadding observability, security and reliability features to Kubernetes deployments\nwithout having to alter the running application code.\n","comments":"\nThe continuing push of applications to the cloud and Kubernetes means that these\ntypes of technology should be assessed with interest in relation to our own\ncloud deployments.\n"},{"id":23,"refName":"sycl","title":"SYCL","quadrantId":"languages-and-frameworks","ring":"assess","description":"[SYCL](https://www.khronos.org/sycl/) defines C++, C++17 is a minimum, abstractions\nto enable heterogeneous device programming. A major goal of SYCL is to enable different\nheterogeneous devices to be used in a single application, for example\nsimultaneous use of CPUs, GPUs, and FPGAs; without the need to write low-level\nkernel code for a particular device.\n","comments":"\nThis is not in active use by any one within the division but is interesting\nenough that it has been placed in assess.\n"},{"id":24,"refName":"podman-cli-desktop","title":"Podman CLI/Desktop","quadrantId":"platforms","ring":"adopt","description":"[Podman](https://podman.io/) is an alternative to Docker for interacting with\ncontainers. It offers both a CLI and Desktop application that are both free to\nuse under an Apache license.\n\nA crucial difference between Podman and Docker is Podman executes as the non-root\nuser by default and does not require a daemon to interact with the containers.\nAll images that work with Docker also work with Podman (and vice versa) as they\nboth build OCI-compatible images.\n","comments":"\nSimilarly to Docker CLI/Desktop these tools are useful for local development but\nproduction-ready deployments should use more advanced tools such as Kubernetes.\n"},{"id":25,"refName":"tailwind-css","title":"Tailwind CSS","quadrantId":"languages-and-frameworks","ring":"trial","description":"[Tailwind](https://tailwindcss.com/) is a framework that supplies CSS classes\nto be composed together directly within markup rather than separating style\ndefinitions into either out of line definitions or separate style files.\nCSS files are still shipped to the browser but these are now products of the\ntailwind compiler and not maintained by hand.\n","comments":"\nThis radar is is developed with Tailwind so we have placed it in the trail ring.\n"},{"id":26,"refName":"power-apps","title":"Power Platform","quadrantId":"platforms","ring":"trial","description":"[Power Platform](https://make.powerapps.com) enables the development of low-code\nsolutions backed either by custom data sources or Microsoft-hosted cloud services.\nPower Apps for creating custom applications with custom workflows based on a\ndiverse set of data sources.\n","comments":"\nOrganizationally we are bought into the M365 ecosystem but our licensing model\nrequires further licenses to develop and produce low-code apps based on data\nsources such as Dataverse. No organizational governance exists but trial\nprojects are being explored by the Science Software Support team.\n"},{"id":27,"refName":"sql-developer","title":"SQL Developer","quadrantId":"platforms","ring":"hold","description":"[SQL Developer](https://www.oracle.com/database/sqldeveloper/) is an integrated\ndevelopment environment for developing and managing Oracle databases both\non-premise and in the cloud.\n","comments":"\nWe have placed this in hold due to a move away from Oracle DB solutions.\n"},{"id":28,"refName":"redpanda","title":"Redpanda","quadrantId":"platforms","ring":"trial","description":"[Redpanda](https://redpanda.com) is an alternative to Kafka for open-source\nevent streaming platform. It offers Kafka-compatible APIs, written in C++, to\nsupport higher throughput that with Apache Kafka. The other key difference is\nthat Zookeeper is not required for coordination of multiple brokers, as it is\nwith versions of Kafka up to 3.3 thereby simplifying deployments.\n","comments":"\nRedpanda is being trialed as part of the SuperMuSR data pipeline by the\nSystems/R and D team.\n"},{"id":29,"refName":"rust","title":"Rust","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[Rust](https://rust-lang.org) is a new systems-programming language designed\nfor performance while maintaining memory- and thread-safety guarantees at\ncompile time.\n","comments":"\nRust is currently being trialed by the Systems and R and D team.\n"},{"id":30,"refName":"ms-access","title":"MS Access","quadrantId":"platforms","ring":"hold","description":"[Microsft Access](https://www.microsoft.com/en-us/microsoft-365/access) is a\ndatabase management system provided by Microsoft as part of the 365 ecosystem.\nIt comprises of a relational database and graphical interface.\n","comments":"\nISIS has legacy MS access applications that are being supported but we do not\nrecommend starting new projects with Access. Cross-platform,\nopen-source databases that support containers should be preferred for new work.\n"},{"id":31,"refName":"nextjs","title":"Next.js","quadrantId":"languages-and-frameworks","ring":"trial","description":"[Next.js](https://nextjs.org) is react-based web framework supporting both\nserver and client components along with support for static site generation (SSG)\nto produce HTML/JS/CSS that can be served by any webserver.\n","comments":"\nCurrently on trial by the Auth team as the new frontend for user office\nauthentication. This site is also written in Next.js and served through\nGitHub pages.\n"},{"id":32,"refName":"longhorn","title":"Longhorn","quadrantId":"platforms","ring":"trial","description":"[Longhorn](https://longhorn.io/) is a distributed block storage system for\nKubernetes.\nLonghorn is cloud-native storage built using Kubernetes and container primitives.\n","comments":"\nCurrently under trial by the interactive reduction project.\n"},{"id":33,"refName":"jwt","title":"JSON Web Tokens","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[JSON Web Tokens](https://jwt.io), more usually abbreivated to JWT, are an industry\nstandard method for securely transmitting sensitive data in a self-contained JSON\nobject. The information can be signed using either a public/private key pair or\nsecret to allow verification of the transmitted information.\n","comments":"\nJWTs are a well established technology that being used by the Users and Auth\nteam.\n"},{"id":34,"refName":"flux","title":"Flux","quadrantId":"tools","ring":"assess","description":"[Flux](https://fluxcd.io/) supports GitOps for infrastructure in Kubernetes\nmuch like ArgoCD and is classed as a continuous delivery tool.\n","comments":"\nArgoCD is currently being trialed but Flux is also popular and worth knowing about\nso it is placed in assess.\n"},{"id":35,"refName":"github","title":"GitHub","quadrantId":"tools","ring":"adopt","description":"[GitHub](https://github.com) is a popular, online solution for hosting Git\nrepositories either for free or as a paid solution.\nIt has become the defacto-standard hosting solution due to the host of other\nfeatures such as code-review, CI/CD, web page hosting tools that are also\nprovided.\n","comments":"\nIt is used by all software teams across the divison so sits in adopt.\n"},{"id":36,"refName":"ensemble-programming","title":"Ensemble Programming","quadrantId":"techniques","ring":"adopt","description":"[Ensemble Programming](https://www.agilealliance.org/glossary/mob-programming/),\nalso known as Mob programming, is the practice of the whole development team\nworking on a single problem at the same time. Originally the team would gather\naround a single computer but with the advent of remote working, tools providing\nshared coding environments have become popular.\n","comments":"\nWe choose the adopt ring as the practice has many benefits such as knowledge transfer,\njust-in-time code review, decreased context switching and has worked well in\nteams that have trialed it.\n"},{"id":37,"refName":"kibana-dashboard","title":"Kibana Dashboard","quadrantId":"platforms","ring":"adopt","description":"[Kibana](https://www.elastic.co/kibana/kibana-dashboard) provides a dashboard for\nviewing Elasticsearch data. It is able to provides charts, maps and filters\ndisplaying real-time monitoring information to summary performance data.\nIt is generally deployed as part of the ELK stack alongside Elasticsearch and\nLogstash.\n","comments":"\nUsed in production by various teams in the User Programme Software group.\n"},{"id":38,"refName":"virtualbox","title":"VirtualBox","quadrantId":"platforms","ring":"adopt","description":"[VirtualBox](https://www.virtualbox.org/) is a desktop virtualisation\ntechnology for running guest operating systems from within a host. [Guest\nadditions](https://www.virtualbox.org/manual/ch04.html) are required to be\ninstalled inside the guest VM to enable certain pieces of functionality.\n","comments":"\nThe core product and guest additions are free to use and licensed under the\nGPLv3. An extension pack, distinct from the guest additions, is licensed\nseparately and should not be used without an appropriate Oracle license. While\ndesktop virtualisation is still useful, particularly for desktop environments,\nit is recommended that container-based solutions are explored first.\nWe continue to place this adopt until it is clearer that it is no longer useful.\n"},{"id":39,"refName":"test-driven-development","title":"Test-Driven Development","quadrantId":"techniques","ring":"adopt","description":"[Test-Driven Development](https://www.agilealliance.org/glossary/tdd/) is a method\nof software development that encourages a style of coding where:\n\n- a unit test is first created for a feature that does not exist\n- the unit test is executed and it fails\n- minimal code is written that causes the test to pass\n- refactor code for [simplicity](https://www.agilealliance.org/glossary/rules-of-simplicity/).\n\nThis loop is repeated and a suite a tests builds over time.\n","comments":"\nThis is a well-known software development tool that is practiced across the division\nso sits in adopt.\n"},{"id":40,"refName":"continuous-deployment","title":"Continuous Deployment","quadrantId":"techniques","ring":"assess","description":"[Continuous Deployment](https://resources.github.com/devops/fundamentals/ci-cd/deployment/)\nbuilds on continuous integration and continuous delivery by automating the entire\ndeployment pipeline.\nOnce a code change passes all required tests it is immediately shipped to\ncustomers with no manual intervention.\n","comments":"\nThe concept requires extensive and advanced automation of deployment pipelines\nand may not be the right fit for some projects.\nIt is something to watch while DevOps experience is built up.\n"},{"id":41,"refName":"balsamiq","title":"Balsamiq Wireframes","quadrantId":"tools","ring":"adopt","description":"[Balsamiq](https://balsamiq.com/) is a UI wireframing tool that produces\nlow-fidelity wireframes when prototyping UI design.\nThe low-fidelity nature of the mockups enables rapid prototyping and shifts\nthe focus from styling and details to structure and content of the screens\nand how they interact.\n","comments":"\nIt is in active use across ICD with licences available should they be required\nso it has been placed it in adopt.\n"},{"id":42,"refName":"fortran","title":"Fortran","quadrantId":"languages-and-frameworks","ring":"hold","description":"[Fortran](https://fortran-lang.org/) is a statically-typed, compiled programming\nlanguage generally associated with high-performance scientific computing\nlibraries.\n","comments":"\nFortran continues to be developed as a language but in many circumstances it has\nbeen replaced by C++ or more recently Rust or Python with compiled internal\nlibraries. It is also more difficult to recruit developers with Fortran skills\nand for these reasons we place it in the hold ring.\n"},{"id":43,"refName":"haskell","title":"Haskell","quadrantId":"languages-and-frameworks","ring":"assess","description":"[Haskell](https://www.haskell.org/) is a purely functional, statically-typed\nprogramming language. Side-effects are not allowed within functions thereby\nlending itself to well to concurrent programming tasks.\n","comments":"\nLike Clojure this could be a useful too for gaining a better understanding of\nthe concepts of functional programming that are useful to appreciate themselves.\n"},{"id":44,"refName":"groundcover","title":"Groundcover","quadrantId":"tools","ring":"assess","description":"[Groundcover](https://www.groundcover.com/) is an monitoring tool for cloud\ndeployments that takes a novel approach of using [eBPF](https://ebpf.io/)\nto gather statistics without having change application code.\n","comments":"\nAs more applications move to the cloud it is a tool that is of interest to watch\nand is placed in assess.\n"},{"id":45,"refName":"power-automate","title":"Power Platform","quadrantId":"platforms","ring":"adopt","description":"[Power Platform](https://make.powerapps.com) enables the development of low-code\nsolutions backed either by custom data sources or Microsoft-hosted cloud services.\nPower Automate supports workflow automation, e.g. email notifications, across\nall power platform projects.\n","comments":"\nOrganizationally we are bought into the M365 ecosystem and power automate is\nalready widely used by the Scientific Software Support team to automate\nmany tasks behind the scenes of many SharePoint sites.\n"},{"id":46,"refName":"nix","title":"Nix","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[Nix](https://nixos.org) is a cross-platform package manager aimed at supporting\nreproducible builds and deployments through the use of hashes containing the\nfull dependency tree. Scripts are written in the Nix language.\n","comments":"\nNix has been adopted by several scientific software packages at ISIS such as\nDissolve and Journal Viewer 2.\n"},{"id":47,"refName":"safe","title":"SAFe","quadrantId":"techniques","ring":"trial","description":"[SAFe](https://scaledagileframework.com/) is a set of organization and workflow\npatterns intended to support scaling up Agile and Lean practices to multiple\nteams within an organization.\n","comments":"\nElements of SAFe are currently being trialed by the Scientific Software Group.\n"},{"id":48,"refName":"matplotlib","title":"Matplotlib","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[Matplotlib](https://matplotlib.org/) is a library for static, animated and\ninteractive visualizations in Python.\n","comments":"\nIt has [two major styles](https://matplotlib.org/stable/users/explain/figure/api_interfaces.html#api-interfaces)\nof using the library:\n\n- An explicit \"Axes\" interface that uses methods on a Figure or Axes object to\n  create other Artists, and build a visualization step by step.\n  This has also been called an \"object-oriented\" interface.\n\n- An implicit \"pyplot\" interface that keeps track of the last Figure and Axes\n  created, and adds Artists to the object it thinks the user wants.\n\nIt is recommended that the `pyplot` interface be used only for the creation of\nfigures and subsequent actions then be performed through the explicit `Axes` objects\nthemselves so it is clear which object will be affected by a given call.\n\n*Warning*: Matplotlib expects to be used in a scripting environment where figures\nare generally re-created should some aspect of the code change.\nIf embedded within a larger application and the figure state can be affected in other\nways then it can be challenging to have access to enough internal state to alter\nthe figures as required without resorting to \"private\" methods that are not off\nlimits in Python.\n"},{"id":49,"refName":"docker-cli-desktop","title":"Docker CLI/Desktop","quadrantId":"platforms","ring":"adopt","description":"[Docker](https://www.docker.com/) is one of the more widely used container\nruntime engines. Docker runs in a client-server mode with a daemon responsible\nfor the full lifecycle of the container and a CLI or desktop application used\nby a user to interact with the containers. By default the Docker daemon requires\nroot privileges and thus all containers runs as root. A rootless mode can be\nconfigured.\n","comments":"\nTypically used locally during development through [docker-compose](https://docs.docker.com/compose/) or in cases of simple\napplications where the complexity of Kubernetes is not deemed necessary.\n\nNote that Docker changed its [license agreement](https://docs.docker.com/subscription/desktop-license/) in 2021 so that Docker Desktop\nis only \"...free for small businesses\n(fewer than 250 employees AND less than $10 million in annual revenue),\npersonal use, education, and non-commercial open source projects.\".\nAs an alternative on Windows many people migrated to Docker through the WSL or\nother tools such as [Podman](https://podman.io/).\n"},{"id":50,"refName":"dotnet-core","title":".NET Core","quadrantId":"languages-and-frameworks","ring":"assess","description":"An open-source, cross-platform managed framework for developing applications.\nCode runs in a managed runtime and the framework provides many class libraries\nfor achieving common programming tasks such as networking and databases.\nIt is a successor to the\n[.NET Framework](https://dotnet.microsoft.com/en-us/download/dotnet-framework).\n","comments":"\nWhile the .NET Framework is still in use across the division it's not clear that\n.NET Core is the natural next step in migration so this remains in the assess\nring.\n"},{"id":51,"refName":"archunit","title":"ArchUnit","quadrantId":"tools","ring":"adopt","description":"[ArchUnit](https://www.archunit.org/) is a library for checking the architecture\nof your Java application. It is able to use any Java unit testing framework and\namongst others checks for:\n\n- dependencies between packages and classes\n- layers and slicing\n- cyclic dependencies\n","comments":"\nIt is a widely used framework for automating architecture rules so we have placed\nit in adopt.\n"},{"id":52,"refName":"functional-programming","title":"Functional Programming","quadrantId":"techniques","ring":"adopt","description":"[Functional Programming](https://en.wikipedia.org/wiki/Functional_programming) is\na programming style that places an emphaisis on immutable state and composition\nof functions to achieve a certain goal. Functional languages such as F#, Haskell,\nhave first-class support for functions but many languages have sufficient\nfeatures to use a functional style.\n","comments":"\nIt is a widely accepted paradigm and should be adopted where appropriate.\n"},{"id":53,"refName":"dotnet-framework-4x","title":".NET Framework 4x","quadrantId":"languages-and-frameworks","ring":"hold","description":"[.NET Framework 4x](https://dotnet.microsoft.com/en-us/download/dotnet-framework)\nis a proprietary framework for building Windows desktop and server-based\napplications.\nCode runs in a managed runtime and the framework provides many class libraries\nfor achieving common programming tasks such as networking and databases.\n","comments":"\nThe final version of .NET framwork has been released with no further updates\nplanned. All future updates in the .NET space will be made as part of the\ncross-platform [.NET Core](https://github.com/dotnet/core) project.\n.NET framework therefore resides in the hold ring.\n"},{"id":54,"refName":"gitops","title":"GitOps","quadrantId":"techniques","ring":"trial","description":"[GitOps](https://www.redhat.com/en/topics/devops/what-is-gitops) uses Git\nrepositories as the source of truth for infrastructure code. Code is reviewed\nand checked by CI processes in the same way as application code. Further tools\nbuild on the configuration as code to support CI/CD to enable reliable\ninfrastructure management.\n","comments":"\nIt is being trialed along with ArgoCD so is placed in the trial ring.\n"},{"id":55,"refName":"pandas","title":"Pandas","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[Pandas](https://pandas.pydata.org/) is a powerful, open-source data analysis\ntool built in Python. It offers a flexible DataFrame structure along with\nstandard algorithms for restructing and operating on the data. It is built\non NumPy.\n","comments":"\nA robust tool, including support for a variety of different file formats\nthat is useful for any ad-hoc analysis so it is in adopt.\n"},{"id":56,"refName":"soap-services","title":"SOAP Services","quadrantId":"techniques","ring":"hold","description":"[SOAP Services](https://en.wikipedia.org/wiki/SOAP) is a communication protocol\nfor the implementation of web services. It uses an XML formatted document, called\na WSDL, to describe the service and the available operations.\n","comments":"\nSOAP services have become less popular with the rise of REST API designs.\nREST offers more flexibility as it permits data transfer in a variety of\nformats while also using stateless operations. SOAP definitions also have to\ndescribe the whole service thereby making changes to elements of a service,\ne.g. a single operation, more difficult to change without impacting all clients.\nFor these reasons SOAP has been placed in hold and it is recommended that it is\nnot used for new projects.\n"},{"id":57,"refName":"opensearch","title":"OpenSearch","quadrantId":"platforms","ring":"trial","description":"[OpenSearch](https://opensearch.org/) is a fork of the Elasticsearch tool by\nAmazon after changes to the Elasticsearch licensing model. OpenSearch continues\nto be developed under an open-source license and supports the same search and\nanalytics capabilities as the original Elasticsearch.\n","comments":"\nOpensearch is currently being trialed by the Risks, Samples and Scheduling team.\n"},{"id":58,"refName":"java","title":"Java","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[Java](https://www.java.com/en/) is a high-level programming language that is\nstatically typed and garbage collected.\nThe language compiles to a bytecode that is agnostic of the target platform\nand requires a Java Virtual Machine to run on the target platform.\n","comments":"\nIf starting a new project then Java 17 should be considered the minimum version\nto adopt and newer if possible. Projects using older versions should form\na migration plan, particularly if Java 8 is still in active use.\n"},{"id":59,"refName":"object-storage","title":"Object Storage","quadrantId":"platforms","ring":"adopt","description":"[Object Storage](https://en.wikipedia.org/wiki/Object_storage) is a data storage\ntechnique that manages data as blobs or objects rather than as a hiearchy or a block.\nThe API presented by object-stores are not concerned with the physical location\nof the data allowing them to store vast amounts of unstructured data.\n","comments":"\nMost public cloud offerings also offer some form of object storage: AWS S3,\nAzure Blob and Google Cloud Storage. The STFC cloud also offers an object store\nthrough the Swift interface. An object store can also offer an S3-compatible\ninterface and take advantage of any existing tools that have been developed for\nthat system.\n\nWe have object storage available in the STFC cloud and it is currently used across\nprojects such as the IDAaaS system for caching experimental data.\n"},{"id":60,"refName":"containerization","title":"Containerization","quadrantId":"techniques","ring":"adopt","description":"A virtualization technique where an application and its dependencies are\npackaged together into an image. Images are executed by a container runtime\nwhere running containers are isolated from each other.\n","comments":"\nContainerization has been widely adopted across many teams by either\nthrough [Kubernetes](https://kubernetes.io/) for production services or\nmore manually for configuring CI nodes.\n"},{"id":61,"refName":"power-bi","title":"Power Platform","quadrantId":"platforms","ring":"adopt","description":"[Power Platform](https://make.powerapps.com) enables the development of low-code\nsolutions backed either by custom data sources or Microsoft-hosted cloud services.\nPower BI for capturing, analysing and visualising real-time data from external\nsources other parts of the power platform.\n","comments":"\nOrganizationally we are bought into the M365 ecosystem and Power BI dashboards\nare being increasingly adopted as visualization tools for data already in\nSharePoint.\n"},{"id":62,"refName":"agile","title":"Agile","quadrantId":"techniques","ring":"adopt","description":"[Agile](https://www.agilealliance.org/) methodologies offer iterative\nmethods of software development compared with models such as Waterfall or\nV-Model. Agile methods have proven more successful at producing software that\nbetter matches customer requirements.\n","comments":"\nAll teams developing software in ICD use some form of agile development, the most\npopular being [Scrum](https://www.atlassian.com/agile/scrum) and\n[Kanban](https://www.atlassian.com/agile/kanban) so this sits in adopt.\n"},{"id":63,"refName":"windows-subsystem-for-linux","title":"Windows Subsystem for Linux","quadrantId":"tools","ring":"adopt","description":"The [Windows Subsystem for Linux](https://learn.microsoft.com/en-us/windows/wsl/),\nor WSL for short, allows users to run GNU/Linux environments directly from within\nWindows without the need for a virtual machine. This gives access to commonly\nused open-source tooling frequently required by developers.\n","comments":"\nUsed reguarly by most teams within the division it is placed in adopt.\n"},{"id":64,"refName":"apache-struts-1","title":"Apache Struts 1","quadrantId":"languages-and-frameworks","ring":"hold","description":"[Apache Struts 1](https://en.wikipedia.org/wiki/Apache_Struts_1) is an\nopen-source web-application framework for Java EE web applications.\n","comments":"\nIt has been succeeded by [Apache Struts 2](https://struts.apache.org) and this\nversion is not longer maintained so it is placed in hold.\n"},{"id":65,"refName":"django","title":"Django","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[Django](https://www.djangoproject.com) is a Python-based, batteries-included\nweb framework following the model-template-views pattern. It is designed for\ncreating complex, database-driven websites.\n","comments":"\nA widely used and robust framework, Django is of particuar interest to those\nwho already have strong experience in the Python ecosystem.\nIt is used by the data reduction team in the scientific software group so has\nbeen placed in adopt.\n"},{"id":66,"refName":"graphql","title":"GraphQL","quadrantId":"techniques","ring":"trial","description":"[GraphQL](https://graphql.org) is a query language for APIs enabling a client\nto specify exactly what data they would like to fetch. It is contrasted with REST\nAPIs where calls to multiple endpoints, each returning a full response, are made.\n","comments":"\nA GraphQL API is under development in the Proposal & Allocations system so we have\nplaced this in trial.\n"},{"id":67,"refName":"apache-kafka","title":"Apache Kafka","quadrantId":"platforms","ring":"adopt","description":"[Apache Kafka](https://kafka.apache.org/) is an open-source distributed event\nstreaming platform boasting:\n\n- High throughput\n- High availability\n- Scalable\n\nIt is widely used across many industries to support data pipelines, streaming\nanalytics and more.\n","comments":"\nAs part of the ESS-in-kind work ISIS developed a data streaming architecture\nfor experimental data based on Kafka.\nA similar system has been implemented at ISIS with experimental data being\npublished to Kafka topics. It is for this reason it has been placed in adopt.\n"},{"id":68,"refName":"git","title":"Git","quadrantId":"tools","ring":"adopt","description":"[Git](https://git-scm.com/) is a distributed version-control system based on a\ncommit graph with links connecting the nodes as snaphots as sequence of states\nof the content.\n","comments":"\nGit has become the defacto-standard version-control system and is used by\nevery software group in the division so is in adopt.\n"},{"id":69,"refName":"elasticsearch","title":"Elasticsearch","quadrantId":"platforms","ring":"hold","description":"[Elasticsearch](https://www.elastic.co/elasticsearch/) provides a full text-search\nengine with a web interface and typically formed part of the ELK\n(Elasticsearch, Logstash and Kibana) stack.\n","comments":"\nDue to licensing changes in 2021 Elasticsearch was forked to a new project\ncalled OpenSearch that remains under the original Apache 2.0 open-source license.\nComplications around licensing mean Elasticsearch has been placed in hold and\nit is suggested to continue using OpenSearch.\n"},{"id":70,"refName":"stfc-cloud","title":"STFC Cloud","quadrantId":"platforms","ring":"adopt","description":"The [STFC Cloud](https://stfc.atlassian.net/wiki/spaces/CLOUDKB/overview) is an\ninternal, private cloud-computing service developed and maintained by the\nScientific Computing Department. Based on Openstack, it offers similar services\nto public cloud offerings such as compute, block storage, object storage,\nload balancers etc. ISIS funds hardware in the cloud both directly and through\nthe IRIS project.\n","comments":"\nA mature platform running production workloads across STFC including many projects\nacross the division. It is recommended that new and existing projects investigate\nthe suitability of the STFC cloud before looking to ISIS-based hardware\nsolutions.\n"},{"id":71,"refName":"black","title":"Black","quadrantId":"tools","ring":"adopt","description":"[Black](https://black.readthedocs.io/en/stable/index.html) is formatter for Python\ncode. It is opinonated and aims for minimum configuration and usage straight out\nof the box.\n","comments":"\nBlack is trusted by most Python projects and widely used by Python projects in\nthe scientific software group so we have placed it in adopt.\n"},{"id":72,"refName":"continuous-integration","title":"Continuous Integration","quadrantId":"techniques","ring":"adopt","description":"[Continuous Integration](https://www.atlassian.com/continuous-delivery/principles/continuous-integration-vs-delivery-vs-deployment)\n\nis the practice of merging\na given set of code changes with the mainline of development and validating them\nwith a suite of automated tests. Changes are typically reviwed and merged\nif these tests pass.\n","comments":"\nAs the most basic tenant of DevOps this technique is adopted across most software\nteams within the division so it sits in adopt.\n"},{"id":73,"refName":"cpp","title":"C++","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[C++](https://isocpp.org/) is a compiled, statically-typed, general-purpose\nsystems programming language. Traditionally used when runtime performance is\ncritical, however difficulties with writing memory-safe code have seen competitors\nsuch as Rust gaining traction in this space.\n","comments":"\nIt is encouraged that projects adopt the latest version of the standard supported\nby the compilers that are available.\n[C++23](https://en.cppreference.com/w/cpp/23) is the latest published version of\nthe standard however this is unlikely to have widespread support at this time.\nThere is widespread\n[compiler support](https://en.cppreference.com/w/cpp/compiler_support/17) for\nC++17 so it is recommended that this be the minimum version of the\nlanguage to support and nothing older.\n"},{"id":74,"refName":"npm","title":"Npm","quadrantId":"tools","ring":"adopt","description":"[Npm](https://www.npmjs.com/) is a package manager for Node.js. It uses lock\nfiles and a `package.json` file to support reproducible builds and deployments.\nIt is supported by the public [npm package registry](https://www.npmjs.com)\nproviding thousands of open-source packages. for the JavaScript community.\n","comments":"\nIt is a widely used tool on most Node projects so is in adopt.\n"},{"id":75,"refName":"grafana","title":"Grafana","quadrantId":"tools","ring":"adopt","description":"[Grafana](https://grafana.com/grafana) is a sophisticated dashboarding tool for\nexploring data from a variety of sources and is typically used as a monitoring tool.\nDashboards can be customised and are extremely flexible in allowing data transforms\nto display the data that is most pertinent.\n","comments":"\nThe wide variety of data connectors and flexibility offered make it a good choice\nfor a dashboarding technology so it sits in adopt.\n"},{"id":76,"refName":"betterer","title":"Betterer","quadrantId":"tools","ring":"assess","description":"[Betterer](https://phenomnomnominal.github.io/betterer/) allows Node.js-based\nprojects to create metrics to define quality goals along with an aim at how\nthis metric should change over time. The library integrates with pre-commmit\nhooks and CI and tracks trends in the defined metrics.\n","comments":"\nWe have placed this in assess as we consider it worth watching but no one has\ntrialed it yet to gain any real experience with it.\n"},{"id":77,"refName":"sharepoint-on-premise","title":"SharePoint On-Premise","quadrantId":"platforms","ring":"hold","description":"[SharePoint On-Premise](https://www.microsoft.com/en-us/microsoft-365/sharepoint/sharepoint-licensing-overview)\nis a version of SharePoint that can be deployed on an ogranization's own hardware.\n","comments":"\nDue to the maintenance burden a shift to a cloud-hosted solution is in progress\nand the on-premise version will eventually be retired. No new projects should\nbe started here.\n"},{"id":78,"refName":"dbeaver","title":"DBeaver","quadrantId":"tools","ring":"adopt","description":"[DBeaver](https://dbeaver.io/) is a cross-platform database management tool\nallowing data manipulation, reporting, data export and many other features.\nIt supports the majority of popular database implementations.\n","comments":"\nIt is considered a useful tool for those who work regularly work with databases\nand has been adopted by several teams.\n"},{"id":79,"refName":"conda","title":"Conda","quadrantId":"tools","ring":"adopt","description":"[Conda](https://conda.io) is a open-source, language-agnostic package manager.\nIt primarily supports Python & R programming languages and was originally\ndeveloped by <https://anaconda.org/> and later released as an open-source\npackage.\n","comments":"\n[Conda-forge](https://conda-forge) is a community-led project providing build\ninfrastructure, recipes and support for popular Conda recipes. It is mature and\nused extensively by the scientific software group so it has been placed in\nassess.\n"},{"id":80,"refName":"artifactory","title":"Artifactory","quadrantId":"platforms","ring":"assess","description":"[Artifactory](https://jfrog.com/artifactory/) by JFrog provide a management\nsystem for binaries, packages, files, containers used by the software\ndevelopment chain.\n","comments":"\nIt is available as a managed solution in both public and private clouds and\nalso as a self-hosted solution. As a widely used solution by many industries\nit has been placed in assess as it is currently not used by ISIS but it could\nbe of interest.\n"},{"id":81,"refName":"vmware","title":"VMWare","quadrantId":"platforms","ring":"adopt","description":"[VMWare](https://www.vmware.com/uk.html) is a virtualisation platform for both\ndesktop and server hardware.\n[VMWare Workstation Player](https://www.vmware.com/uk/products/workstation-player.html)\nis a free version of the desktop software that does not offer any kind of support.\n","comments":"\nIt is adopted for virtualisation on server hardware but less so for desktop\nvirtualisation where Virtualbox is preferred. While desktop virtualisation is\nstill useful, particularly for desktop environments, it is recommended that\ncontainer-based solutions are explored first.\nWe continue to place this adopt until it is clearer that it is no longer useful.\n"},{"id":82,"refName":"uml","title":"UML","quadrantId":"techniques","ring":"adopt","description":"[UML](https://www.visual-paradigm.com/guide/uml-unified-modeling-language/what-is-uml/)\nis a modeling language consisting of a set of diagrams for representing\nartifacts of a system that enable teams to communicate with a common language\nregarding elements such as code, process or state, to name a few.\nMany diagram types exist depending what is but being modeled but common diagrams\nin software include class, sequence and package.\n","comments":"\nA common tool used in many aspects of the development process we consider this\nadopted.\n"},{"id":83,"refName":"typescript","title":"TypeScript","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[TypeScript](https://www.typescriptlang.org) adds additional syntax to\nJavaScript allowing for strong typing. TypeScript compiles to JavaScript so that\nno additional tools are required to run the code on the client side. Typing also\nallows for better integration with code completion in editors.\n","comments":"\nWidely adopt by all projects using JavaScript as a language so it resides in the\nadopt ring.\n"},{"id":84,"refName":"qt","title":"Qt","quadrantId":"languages-and-frameworks","ring":"adopt","description":"[Qt](https://doc.qt.io/) is a cross-platform, C++ application framework primarily\nused for writing cross-platform graphical user interfaces, also supporting\nembedded devices.\n","comments":"\nQt 6 is the latest major version and it is recommended that this be adopted if\npossible but note that Qt 6 requires a relatively modern Linux distribution,\nfor example Red Hat >= 8.4, so if support for an older Linux OS is required then\nQt 5 is still available or consider running the application in a container.\n\nQt is written in C++ but there are also Python bindings, e.g.\n[PyQt](https://www.riverbankcomputing.com/software/pyqt/), available for writing\napplications in Python that are backed by the Qt framework.\n"},{"id":85,"refName":"rest","title":"REST","quadrantId":"techniques","ring":"adopt","description":"[REST](https://www.redhat.com/en/blog/rest-architecture) is a style of architecture\nthat constrains an API to follow a set of RESTful principles:\n\n- Uniform interface\n- Stateless\n- Layered\n- Cacheability\n- Code on demand\n","comments":"\nIt is a well-established style and should be a strong consideration when\nconsidering implementing an API. As an example the Auth team have developed\na RESTful API.\n"},{"id":86,"refName":"flask","title":"Flask","quadrantId":"languages-and-frameworks","ring":"assess","description":"[Flask](https://flask.palletsprojects.com/) is a small web framework for Python.\nIn contrast to Django it has very little built-in concepts such as database\nabstractions but relies on third-party libraries to provide these features.\n","comments":"\nIt's simplicity makes it easy to learn and understand. It currently resides in\nassess as we are not aware of anyone using it but it is worthy of trialing.\n"},{"id":87,"refName":"renovate","title":"Renovate","quadrantId":"tools","ring":"assess","description":"[Renovate](https://www.mend.io/renovate/) is a dependency scanner that includes\nthe ability to automatically update dependencies and create pull requests for\nreview by a developer. It supports many\n[popular languages](https://docs.renovatebot.com/bazel).\n","comments":"\nGitHub also offer [Dependabot](https://github.com/dependabot) with a similar\nphilosophy. It is worth assessing if Renovate offers anything extra ontop of\nDependabot.\n"},{"id":88,"refName":"jupyter-notebooks","title":"Jupyter Notebooks","quadrantId":"platforms","ring":"adopt","description":"[Jupyter Notebooks](https://jupyter.org/) offer a web-based, interactive,\nnotebook-like environment that is able to combine text with editable code and\nvisualizations. Code execution is handled by separate kernels enables support\nfor a wide variety of langagues such as Python, R, Julia and many more.\n","comments":"\nTheir flexible nature makes them a good choice for defining scientific workflows\nand have been adopted by the Scientific Software Group.\n"}]}